In [2]:
import numpy as np
import pandas as pd

# Titani DATASET

In [8]:
titanic = pd.read_csv("titanic.csv")
print(titanic.shape)
titanic.head()

(668, 11)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [10]:
X = titanic.iloc[:,0:titanic.shape[1]-1]
Y = titanic.iloc[:,-1]
Y

0      1
1      0
2      0
3      0
4      0
      ..
663    1
664    0
665    1
666    0
667    1
Name: Survived, Length: 668, dtype: int64

In [12]:
from sklearn import model_selection
X_train,X_test,Y_train,Y_test = model_selection.train_test_split(X,Y,random_state=123211)
print(type(X_train))
print(type(Y_train))
print(type(Y_test))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [16]:
X_Y_train = X_train.copy()
X_Y_train['Survived'] = Y_train
print(X_Y_train.shape)
print(X_test.shape)
print(Y_train.shape)

X_Y_train.to_csv('titanic_x_y_train.csv',index=False)
X_train.to_csv('titanic_x_train.csv',index=False)
Y_train.to_csv('titanic_y_train.csv',index=False)
X_test.to_csv('titanic_x_test.csv',index=False)
Y_test.to_csv('titanic_y_test.csv',index=False)

(501, 11)
(167, 10)
(501,)

In [48]:
X_Y_train_l = pd.read_csv('titanic_x_y_train.csv',delimiter=',')
X_test_l = pd.read_csv('titanic_x_test.csv',delimiter=',')

print(X_Y_train_l.shape)
X_Y_train_l.isnull().sum()

(501, 11)

Pclass        0
Name          0
Sex           0
Age          99
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       391
Embarked      1
Survived      0
dtype: int64

In [49]:
del X_Y_train_l["Name"]
del X_Y_train_l["Ticket"]
del X_Y_train_l["Cabin"]
del X_Y_train_l["Fare"]
X_Y_train_l.head()

   Pclass     Sex   Age  SibSp  Parch Embarked  Survived
0       3    male  17.0      1      0        S         0
1       1    male  27.0      0      0        C         1
2       3  female  48.0      1      3        S         0
3       2  female  54.0      1      3        S         1
4       3    male   NaN      1      0        Q         0

In [50]:
del X_test_l["Name"]
del X_test_l["Ticket"]
del X_test_l["Cabin"]
del X_test_l["Fare"]

In [51]:
print(X_Y_train_l.isnull().sum())
print(X_Y_train_l.shape)
X_Y_train_l = X_Y_train_l.fillna(X_Y_train_l.median())
print(X_Y_train_l.isnull().sum())
X_Y_train_l.shape

Pclass       0
Sex          0
Age         99
SibSp        0
Parch        0
Embarked     1
Survived     0
dtype: int64
(501, 7)
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Embarked    1
Survived    0
dtype: int64

/tmp/ipykernel_6202/38771806.py:3: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  X_Y_train_l = X_Y_train_l.fillna(X_Y_train_l.median())

(501, 7)

In [52]:
X_Y_train_l.dropna(inplace=True)
print(X_Y_train_l.isnull().sum())
X_Y_train_l.shape

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Embarked    0
Survived    0
dtype: int64

(500, 7)

In [53]:
X_train_l = X_Y_train_l.iloc[:,:X_Y_train_l.shape[1]-1]
print(X_train_l.shape)
Y_train_l = X_Y_train_l.iloc[:,-1]
print(Y_train_l.shape)
print(Y_train_l)

(500, 6)
(500,)
0      0
1      1
2      0
3      1
4      0
      ..
496    0
497    0
498    1
499    1
500    1
Name: Survived, Length: 500, dtype: int64

In [54]:
def getNumber(str):
    if str=="male":
        return 1
    else:
        return 2

X_train_l['gender'] = X_train_l["Sex"].apply(getNumber)
print(X_train_l)
del X_train_l["Sex"]
X_train_l.head()

     Pclass     Sex   Age  SibSp  Parch Embarked  gender
0         3    male  17.0      1      0        S       1
1         1    male  27.0      0      0        C       1
2         3  female  48.0      1      3        S       2
3         2  female  54.0      1      3        S       2
4         3    male  29.0      1      0        Q       1
..      ...     ...   ...    ...    ...      ...     ...
496       3    male  29.0      0      0        S       1
497       3    male   9.0      4      2        S       1
498       1    male  49.0      1      0        C       1
499       2    male  42.0      0      0        S       1
500       3  female  29.0      0      0        Q       2

[500 rows x 7 columns]

   Pclass   Age  SibSp  Parch Embarked  gender
0       3  17.0      1      0        S       1
1       1  27.0      0      0        C       1
2       3  48.0      1      3        S       2
3       2  54.0      1      3        S       2
4       3  29.0      1      0        Q       1

In [55]:
X_test_l['gender'] = X_test_l["Sex"].apply(getNumber)
print(X_test_l)
del X_test_l["Sex"]
X_test_l.head()

     Pclass     Sex   Age  SibSp  Parch Embarked  gender
0         3  female   NaN      1      0        S       2
1         3    male  32.0      0      0        S       1
2         2  female  40.0      0      0        S       2
3         2  female  45.0      1      1        S       2
4         3  female  28.0      0      0        S       2
..      ...     ...   ...    ...    ...      ...     ...
162       3    male  51.0      0      0        S       1
163       1    male  36.0      0      0        S       1
164       1    male  39.0      0      0        S       1
165       2  female  30.0      0      0        S       2
166       3    male  25.0      0      0        S       1

[167 rows x 7 columns]

   Pclass   Age  SibSp  Parch Embarked  gender
0       3   NaN      1      0        S       2
1       3  32.0      0      0        S       1
2       2  40.0      0      0        S       2
3       2  45.0      1      1        S       2
4       3  28.0      0      0        S       2

In [57]:
def getNumberEmbarked(str):
    if str=='C':
        return 1
    elif str=='Q':
        return 2
    else:
        return 3

X_train_l['Embarked'] = X_train_l["Embarked"].apply(getNumberEmbarked)
X_train_l.head()

   Pclass   Age  SibSp  Parch  Embarked  gender
0       3  17.0      1      0         3       1
1       1  27.0      0      0         1       1
2       3  48.0      1      3         3       2
3       2  54.0      1      3         3       2
4       3  29.0      1      0         2       1

In [59]:
X_test_l['Embarked'] = X_test_l['Embarked'].apply(getNumberEmbarked)
X_test_l.head()

   Pclass   Age  SibSp  Parch  Embarked  gender
0       3   NaN      1      0         3       2
1       3  32.0      0      0         3       1
2       2  40.0      0      0         3       2
3       2  45.0      1      1         3       2
4       3  28.0      0      0         3       2

In [60]:
print(X_test_l.isnull().sum())
X_test_l = X_test_l.fillna(X_test_l.median())
X_test_l.isnull().sum()

Pclass       0
Age         33
SibSp        0
Parch        0
Embarked     0
gender       0
dtype: int64

Pclass      0
Age         0
SibSp       0
Parch       0
Embarked    0
gender      0
dtype: int64

# Decision Tree

In [117]:
from sklearn import tree
clf = tree.DecisionTreeClassifier(random_state=5)
clf.fit(X_train_l,Y_train_l)
Y_pred_l = clf.predict(X_test_l)
clf.score(X_train_l,Y_train_l), clf.score(X_test_l,Y_test)

(0.936, 0.8083832335329342)

In [118]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier(max_depth=6,random_state=0)
clf.fit(X_train_l,Y_train_l)
clf.score(X_train_l,Y_train_l),clf.score(X_test_l,Y_test)

(0.862, 0.8203592814371258)